{
  "title": "Comparisons: Cấu trúc so sánh",
  "sections": [
    {
      "sectionTitle": "4. Comparisons: Cấu trúc so sánh",
      "data": "Cấu trúc so sánh trong tiếng Anh bao gồm 5 cấu trúc so sánh phổ biến sau: so sánh bằng, so sánh nhất, so sánh hơn, so sánh bội số và so sánh kép."
    },
    {
      "sectionTitle": "4.1. So sánh bằng",
      "data": "Công thức: \n\nS + V + as + (adj/ adv) + as \n\nS + V + the same + (noun) + as\n\nVí dụ: \n\nSarah sings as beautifully as her sister.\n→ Sarah hát hay như chị gái của cô ấy.\n\nJohn's car is the same color as mine.\n→ Xe của John có màu giống như của tôi.\n\nThis restaurant's food tastes as good as the food at the five-star hotel.\n→ Đồ ăn ở nhà hàng này ngon như đồ ăn ở khách sạn năm sao."
    },
    {
      "sectionTitle": "4.2. So sánh hơn",
      "data": "Công thức: \n\nS + V + (Adj/Adv) + “-er” + than\n\nS + V + more + Adj/Adv + than\n\nVí dụ: \n\nTom is taller than his brother.\n→ Tom cao hơn anh trai của mình.\n\nSarah's essay is more well-written than mine.\n→ Bài luận của Sarah viết tốt hơn của tôi.\n\nThe new laptop is more expensive than the old one.\n→ Chiếc laptop mới đắt hơn chiếc cũ."
    },
    {
      "sectionTitle": "4.3. So sánh nhất",
      "data": "Công thức: \n\nS + V + the + Adj/Adv + -est\n\nS + V + the + most + Adj/Adv\n\nVí dụ: \n\nSarah is the tallest girl in her class.\n→ Sarah là cô gái cao nhất trong lớp của cô ấy.\n\nThis is the most beautiful painting I've ever seen.\n→ Đây là bức tranh đẹp nhất mà tôi từng thấy.\n\nThe Sahara desert is the most arid place on Earth.\n→ Sa mạc Sahara là nơi khô nhất trên Trái Đất."
    },
    {
      "sectionTitle": "4.4. So sánh bội số",
      "data": "Công thức: \n\nS + V + multiple numbers as + much/many/adj/adv + noun + as + noun\n\nVí dụ: \n\nSarah has twice as many books as John.\n→ Sarah có số lượng sách nhiều gấp đôi so với John.\n\nThe new computer can process data three times as quickly as the old one.\n→ Máy tính mới có thể xử lý dữ liệu nhanh gấp ba lần so với máy cũ.\n\nJack can lift twice as much weight as his brother.\n→ Jack có thể nâng được trọng lượng gấp đôi so với anh trai của mình"
    },
    {
      "sectionTitle": "4.5. So sánh kép",
      "data": "Công thức: \n\nThe + so sánh hơn 1 + S1 + V2 + the + so sánh hơn 2 + S2 + V2\n\nVí dụ: \n\nThe earlier you start saving money, the more you will have for retirement.\n→ Bạn bắt đầu tiết kiệm tiền càng sớm, bạn sẽ có càng nhiều tiền cho việc về hưu.\n\nThe harder you work, the more successful you will become.\n→ Bạn càng chăm chỉ làm việc, bạn sẽ càng trở nên thành công hơn.\n\nThe more you practice, the better you will become at playing the piano.\n→ Bạn càng luyện tập nhiều, bạn sẽ càng trở nên giỏi hơn trong việc chơi đàn piano."
    }
  ]
}
